* Tasks
  :PROPERTIES:
  :ARCHIVE:  %s_archive::* My Tasks
  :END:
** SOMEDAY Read sinatra code					       :RUBY:
   - State "SOMEDAY"    from "NEXT"       [2010-11-15 Mon 10:42]
   - State "NEXT"       from "TODO"       [2010-08-04 Wed 13:21]
   - State "TODO"       from "NEXT"       [2010-08-02 Mon 01:17]
   - State "NEXT"       from "TODO"       [2010-08-01 Sun 00:14]
   :CLOCK:
   CLOCK: [2010-08-04 Wed 13:56]--[2010-08-04 Wed 13:58] =>  0:02
   CLOCK: [2010-08-04 Wed 13:50]--[2010-08-04 Wed 13:56] =>  0:06
   CLOCK: [2010-08-04 Wed 13:47]--[2010-08-04 Wed 13:49] =>  0:02
   CLOCK: [2010-08-04 Wed 13:39]--[2010-08-04 Wed 13:47] =>  0:08
   CLOCK: [2010-08-04 Wed 13:26]--[2010-08-04 Wed 13:38] =>  0:12
   CLOCK: [2010-08-04 Wed 13:21]--[2010-08-04 Wed 13:26] =>  0:05
   CLOCK: [2010-08-01 Sun 00:14]--[2010-08-01 Sun 00:32] =>  0:18
   :END:
** SOMEDAY Read up on RSpec					       :RUBY:
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:15]
   - State "TODO"       from "NEXT"       [2010-08-05 Thu 08:51]
   - State "NEXT"       from "TODO"       [2010-08-05 Thu 07:56]
   :CLOCK:
   CLOCK: [2010-08-05 Thu 08:19]--[2010-08-05 Thu 08:50] =>  0:31
   CLOCK: [2010-08-05 Thu 07:56]--[2010-08-05 Thu 08:18] =>  0:22
   :END:
** SOMEDAY Read Ruby I/O chapter				       :RUBY:
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:15]
** PROJECT Read up on org-mode						:ORG:
   - State "PROJECT"    from "TODO"       [2010-11-22 Mon 09:50]
   :CLOCK:
   CLOCK: [2010-07-31 Sat 13:40]--[2010-07-31 Sat 14:44] =>  1:04
   :END:
*** DONE [[file:notes.org::*org%205%20minute%20tutorial][org 5 minute tutorial]]
    - State "DONE"       from "NEXT"       [2010-08-01 Sun 14:49]
    - State "NEXT"       from "TODO"       [2010-08-01 Sun 14:40]
    - State "NEXT"       from "TODO"       [2010-08-01 Sun 14:40]
    :CLOCK:
    CLOCK: [2010-08-01 Sun 14:40]--[2010-08-01 Sun 14:49] =>  0:09
    CLOCK: [2010-08-01 Sun 09:12]--[2010-08-01 Sun 09:14] =>  0:02
    :END:
    - State "TODO"       from ""           [2010-08-01 Sun 09:12]
*** CANCELLED [[file:notes.org::*compact%20org%20mode%20guide][compact org-mode guide]]
    - State "CANCELLED"  from "TODO"       [2010-11-22 Mon 09:25]
    - State "TODO"       from "NEXT"       [2010-11-15 Mon 10:42]
    - State "NEXT"       from "TODO"       [2010-08-04 Wed 12:40]
    - State "TODO"       from "NEXT"       [2010-08-03 Tue 10:59] \\
      read tags on org compact and sacha chua's article on org tags
    - State "NEXT"       from "TODO"       [2010-08-03 Tue 10:17]
    - State "TODO"       from "NEXT"       [2010-08-02 Mon 15:19] \\
      completed document structure
      started tables
    - State "NEXT"       from "TODO"       [2010-08-02 Mon 15:02]
    - State "TODO"       from "NEXT"       [2010-08-02 Mon 00:50] \\
      paused
    - State "NEXT"       from "TODO"       [2010-08-01 Sun 14:53]
    :CLOCK:
    CLOCK: [2010-08-05 Thu 10:11]--[2010-08-05 Thu 10:42] =>  0:31
    CLOCK: [2010-08-04 Wed 12:40]--[2010-08-04 Wed 13:06] =>  0:26
    CLOCK: [2010-08-03 Tue 10:17]--[2010-08-03 Tue 10:58] =>  0:41
    CLOCK: [2010-08-02 Mon 15:02]--[2010-08-02 Mon 15:20] =>  0:18
    CLOCK: [2010-08-01 Sun 14:55]--[2010-08-01 Sun 15:07] =>  0:12
    CLOCK: [2010-08-01 Sun 14:53]--[2010-08-01 Sun 14:55] =>  0:02
    :END:
*** NEXT Read http://doc.norang.ca/org-mode.html
** SOMEDAY check out [[http://emacs-fu.blogspot.com/2010/06/console-apps-in-emacs-with-multi-term.html][autopair]] emacs minor mode			      :EMACS:
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:18]
   - State "TODO"       from ""           [2010-08-02 Mon 16:18]
** CANCELLED configure colors for tags in org mode		 :ACTION:ORG:
   - State "CANCELLED"  from "NEXT"       [2010-08-03 Tue 11:08] \\
     tags should be invisible until queries for
   - State "NEXT"       from "TODO"       [2010-08-03 Tue 11:04]
   :CLOCK:
   CLOCK: [2010-08-03 Tue 11:04]--[2010-08-03 Tue 11:08] =>  0:04
   :END:
   - State "TODO"       from ""           [2010-08-03 Tue 10:46]
** SOMEDAY Implement rummy in Ruby				       :RUBY:
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:21]
  :CLOCK:
  CLOCK: [2010-08-03 Tue 22:38]--[2010-08-03 Tue 22:39] =>  0:01
  :END:
  [2010-08-03 Tue 22:38]
** NEXT read bastien guerry's column view intro				:ORG:
   - State "NEXT"       from "TODO"       [2010-11-22 Mon 09:21]
   - State "TODO"       from ""           [2010-08-04 Wed 12:52]

** SOMEDAY Analyze ruby quiz solution and alternate solutions	       :RUBY:
   - State "SOMEDAY"    from "NEXT"       [2010-11-15 Mon 10:42]
   - State "NEXT"       from "TODO"       [2010-08-05 Thu 22:05]
   :CLOCK:
   CLOCK: [2010-08-05 Thu 22:05]--[2010-08-05 Thu 22:32] =>  0:27
   :END:
   - State "TODO"       from ""           [2010-08-04 Wed 18:58]
** SOMEDAY read up on exceptions in ruby			       :RUBY:
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:21]
   :CLOCK:
   :END:
   [2010-08-04 Wed 13:26]
   [[file:~/ruby-projects/sinatra/lib/sinatra/base.rb::require%20thread][file:~/ruby-projects/sinatra/lib/sinatra/base.rb::require thread]]
** SOMEDAY what is the difference between passing zero and one arguments to inject :RUBY:
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:21]
   :CLOCK:
   :END:
   [2010-08-04 Wed 13:47]
** SOMEDAY Read up on HTTP
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:21]
   - State "NEXT"       from "TODO"       [2010-08-05 Thu 07:40]
   :CLOCK:
   CLOCK: [2010-08-04 Wed 13:49]--[2010-08-04 Wed 13:50] =>  0:01
   :END:
   [2010-08-04 Wed 13:49]
   [[file:~/ruby-projects/sinatra/lib/sinatra/base.rb::class%20Response%20Rack%20Response][file:~/ruby-projects/sinatra/lib/sinatra/base.rb::class Response Rack Response]]
** SOMEDAY Explain block.each					       :RUBY:
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:21]
   :CLOCK:
   :END:
   [2010-08-04 Wed 13:56]
   [[file:~/ruby-projects/sinatra/lib/sinatra/base.rb::if%20block_given%20def%20block%20each%20yield%20call%20end%20What%20is%20this%20line%20EXPLAIN%20response%20body%20block%20else%20response%20body%20value%20end][file:~/ruby-projects/sinatra/lib/sinatra/base.rb::if block_given def block each yield call end What is this line EXPLAIN response body block else response body value end]]
** SOMEDAY investigate using global for spelunking ruby projects       :RUBY:
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:22]
   http://www.codespelunking.org/pages/cs_global.html
   :CLOCK:
   CLOCK: [2010-08-04 Wed 15:58]--[2010-08-04 Wed 15:59] =>  0:01
   :END:
   [2010-08-04 Wed 15:58]
** SOMEDAY add rdebug interface to emacs			      :EMACS:
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:22]
   :CLOCK:
   :END:
   [2010-08-04 Wed 17:56]
   [[file:~/my-ruby/ruby-quiz/1/rubyquiz-1.rb::new_card_index%20current_card_index%20distance%20modulo%2054%201][file:~/my-ruby/ruby-quiz/1/rubyquiz-1.rb::new_card_index current_card_index distance modulo 54 1]]
** SOMEDAY Evaluate and deploy best webserver for rails		      :RAILS:
   - State "SOMEDAY"    from "TODO"       [2010-11-22 Mon 09:22]
   - State "TODO"       from ""           [2010-08-06 Fri 00:12]
